In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    "first" : ["Sutton" , "Kat" , "Jane" , "Richard" , None , 'NA'] ,
     "last" : ["Brady" , "Edison" , "Sloan" , "Hunter" , np.nan , 'Missing'] ,
     "age" : ["26" , "25" , "25" , "40" , "NA" , "38"],
     "email" : ["sutton@gmail.com" , "kat@gmail.com" , "jane@gmail.com",None , "richardhunter@gmail.com" , 'NA'],
     "workplace" : ["Scarlet" , "Scarlet" , "Incite" , "Stafford", "Pinstripe", 'NA']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     first     last age                    email  workplace
0   Sutton    Brady  26         sutton@gmail.com    Scarlet
1      Kat   Edison  25            kat@gmail.com    Scarlet
2     Jane    Sloan  25           jane@gmail.com     Incite
3  Richard   Hunter  40                     None   Stafford
4     None      NaN  NA  richardhunter@gmail.com  Pinstripe
5       NA  Missing  38                       NA         NA

In [5]:
## Dropna

In [6]:
df.replace('NA' , np.nan , inplace = True)
df.replace('Missing' , np.nan , inplace = True)

In [7]:
df.dropna()

    first    last age             email workplace
0  Sutton   Brady  26  sutton@gmail.com   Scarlet
1     Kat  Edison  25     kat@gmail.com   Scarlet
2    Jane   Sloan  25    jane@gmail.com    Incite

In [8]:
df.dropna(axis = 'index' , how = 'all' , subset  = ['last','email'])

     first    last  age                    email  workplace
0   Sutton   Brady   26         sutton@gmail.com    Scarlet
1      Kat  Edison   25            kat@gmail.com    Scarlet
2     Jane   Sloan   25           jane@gmail.com     Incite
3  Richard  Hunter   40                     None   Stafford
4     None     NaN  NaN  richardhunter@gmail.com  Pinstripe

In [9]:
df.isna()

   first   last    age  email  workplace
0  False  False  False  False      False
1  False  False  False  False      False
2  False  False  False  False      False
3  False  False  False   True      False
4   True   True   True  False      False
5   True   True  False   True       True

In [10]:
df.fillna('MISSING')
# Replaces na value with String "Missing"

     first     last      age                    email  workplace
0   Sutton    Brady       26         sutton@gmail.com    Scarlet
1      Kat   Edison       25            kat@gmail.com    Scarlet
2     Jane    Sloan       25           jane@gmail.com     Incite
3  Richard   Hunter       40                  MISSING   Stafford
4  MISSING  MISSING  MISSING  richardhunter@gmail.com  Pinstripe
5  MISSING  MISSING       38                  MISSING    MISSING

In [11]:
df.dtypes

first        object
last         object
age          object
email        object
workplace    object
dtype: object

In [12]:
#df['age'].mean()
Throws error since

SyntaxError: invalid syntax (<ipython-input-12-f254e4f489d6>, line 2)

In [ ]:
type(np.nan)

Typecasting to float since nan values are float and rest are int

In [ ]:
df['age'] = df['age'].astype(float)

In [ ]:
df['age'].mean()

In [ ]:
df.astype()